source/Lesson_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Game of Life</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">The Game of Life</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. I got bills</a>
<ul>
<li><a href="#sec-1-1">Download It</a></li>
<li><a href="#sec-1-2">Learn It</a></li>
<li><a href="#sec-1-3">Try It</a></li>
<li><a href="#sec-1-4">Code It</a></li>
<li><a href="#sec-1-5">Try It</a></li>
<li><a href="#sec-1-6">Badge  It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="https://github.com/stsb11/9-CS-gameOfLife">Fork me on GitHub</a>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> I got bills</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>LunchMoney Lewis made a good point.
</li>
<li>Some jobs pay weekly, but most pay you once a month. If you don't plan carefully with your expenditure, you'll find yourself in financial difficulty. 
</li>
<li>As people sometimes say, its easy to find that there's too much month left at the end of the money, and going overdrawn (i.e. having a negative bank balance) can become very expensive, very quickly. 
</li>
<li>Today, you'll learn about how much it actually costs to run a household, using a spreadsheet to help you model it. 
</li>
<li>Some adults use a spreadsheet to help them keep track of their finances, to avoid going overdrawn before the next pay-day.
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3 document">
<h3 id="sec-1-1">Download It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Download <a href="./doc/budget.xlsx">this file</a> to your H: drive, and save it in a new folder.
</li>
<li>Open the spreadsheet in Excel.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Your household budget consists of several categories:
<ul class="org-ul">
<li>Income: Money coming in from your job,
</li>
<li>Fixed outgoings: Bills that are predictable and regular, e.g. Rent,
</li>
<li>One-off outgoings: Less regular bills, e.g. Annual TV licence,
</li>
<li>Unexpected outgoings: Things you can't anticipate, e.g. car breakdown bills.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 try">
<h3 id="sec-1-3">Try It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>In the outgoings column, write as many different types of bill that you can think of in the left column. Don't worry about the amount yet; this will come later.
</li>
<li>In the income section, write your monthly <i>takehome</i> pay amount that you calculated in the last lesson. We can always change this later.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Code It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>The next step will be to 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 try">
<h3 id="sec-1-5">Try It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Use the data above to complete cells <code>C19</code>, <code>C20</code> and <code>C21</code>. 
</li>
<li>Write formulae in cells <code>C23</code>, <code>C24</code> and <code>C25</code> to calculate the hourly rate for a job paying £15,000 per year. 
</li>
<li>Is that more or less than the minimum wage for someone aged 23?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 badge">
<h3 id="sec-1-6">Badge  It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Complete the formulae above.
</li>
<li><b>Silver:</b> What is the hourly rate for someone on £20,000 a year?
</li>
<li><b>Gold:</b> Find the average UK annual salary, and calculate what this is as an hourly rate. What is the weekly <i>take-home</i> pay for this salary?
</li>
<li><b>Platinum:</b> What is the pre-tax (i.e. not take-home) salary of someone earning £30 per hour?
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
